# -*- coding: utf-8 -*-
'''
Задание 4.8

Преобразовать IP-адрес в двоичный формат и вывести на стандартный поток вывода вывод столбцами, таким образом:
- первой строкой должны идти десятичные значения байтов
- второй строкой двоичные значения

Вывод должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов

Пример вывода для адреса 10.1.1.1:
10        1         1         1
00001010  00000001  00000001  00000001

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

ip = '192.168.3.1'
res = ip.split('.')
table = f"""\033[93m
{res[0]:10}{res[1]:10}{res[2]:10}{res[3]:10}
{int(res[0]):08b}  {int(res[1]):08b}  {int(res[2]):08b}  {int(res[3]):08b}
"""
print(table)